:PROPERTIES:
:ID:       df7f060a-d663-4eaa-844e-f8baec7c94a2
:END:
#+TITLE: SystemD
#+DESCRIPTION:
#+TAGS:

**** Nixpkgs

Units specifying an edge to another unit.

#+name: nixpkgsSystemdEdges
#+begin_src shell :results output table :var type="target" checkout="/data/ecto/nixos/nixos/nixpkgs" include="" exclude=""
#  'wantedby\s*=.*\[.*".*\.target"' # '.*\[.*".*\.target"'
grep  --include='*.nix' -ire '=.*\[.*".*\.'$type'"' $checkout \
| grep -i "$include" | grep -iv "${exclude:-\0}" | sed -E 's/.*(\[.*\]);/\1/g' \
| grep -E '^\[' | sed -E 's/\[ *"(.*)" *\].*/\1/g' \
| sort | uniq
# the null char in exclude is probably unsafe... it's also temperamental
# (1) req. echo -e (2) can't quote a variable after assigning nullchar
# (3) grep warns you

# d=$(date +%s | rev); h=$(echo $d | sha256sum | rev); grep -v $h # - \bacd8b8ceb8c ... lol woops
#+end_src

Files with units

#+name: nixpkgsSystemdFilesWithUnits
#+begin_src shell :results output table :var type="path" checkout="/data/ecto/nixos/nixos/nixpkgs"
grep -l --include='*.nix' -ire ' \+".*\.'$type'" \+' $checkout | grep -v 'nixos/tests/'
#+end_src

#+RESULTS: nixpkgsSystemdFilesWithUnits
| /data/ecto/nixos/nixos/nixpkgs/pkgs/development/python-modules/svg-path/default.nix    |
| /data/ecto/nixos/nixos/nixpkgs/pkgs/development/python-modules/jaraco-path/default.nix |
| /data/ecto/nixos/nixos/nixpkgs/nixos/modules/system/boot/systemd/initrd.nix            |
| /data/ecto/nixos/nixos/nixpkgs/nixos/modules/system/boot/systemd/user.nix              |
| /data/ecto/nixos/nixos/nixpkgs/nixos/modules/services/cluster/hadoop/default.nix       |
| /data/ecto/nixos/nixos/nixpkgs/nixos/modules/services/monitoring/thanos.nix            |
| /data/ecto/nixos/nixos/nixpkgs/nixos/modules/services/misc/zoneminder.nix              |

#+call: nixpkgsSystemdFilesWithUnits(checkout="/data/ecto/nixos/nixos/nixpkgs", type="timer")

****** Diffable

#+begin_quote
The package graphs are not usually diffable (they're not flat and involve
tracking package identity with misc IDs)
#+end_quote

for basic comparison, at least for simple cases, these can sort because they're
flat graphs -- i.e. only one edge definition per line, with deterministically
computed node id's

#+begin_src shell :results output code :wrap example diff :var system="kharis" :dir (expand-file-name ".dotfiles" (getenv "HOME"))
sys1="dc/dc/system/$system-x11.scm"
sys2="dc/dc/system/$system.scm"

# produce the .dot graph files
diff <(guix system -L ellipsis/ -L dc/ shepherd-graph "$sys1" | sort) \
    <(guix system -L ellipsis/ -L dc/ shepherd-graph "$sys2" | sort)
echo ''
#+end_src

#+RESULTS:
#+begin_example diff
12a13,26
>   "cgroups2-fs-owner" -> "cgroups2-limits" [color = blue];
>   "cgroups2-fs-owner" -> "dbus-system" [color = blue];
>   "cgroups2-fs-owner" [label = "cgroups2-fs-owner", shape = box, fontname = sans];
>   "cgroups2-fs-owner" -> "NetworkManager networking" [color = blue];
>   "cgroups2-fs-owner" -> "seatd elogind" [color = blue];
>   "cgroups2-fs-owner" -> "udev" [color = blue];
>   "cgroups2-fs-owner" -> "user-processes" [color = blue];
>   "cgroups2-limits" -> "dbus-system" [color = darkseagreen];
>   "cgroups2-limits" [label = "cgroups2-limits", shape = box, fontname = sans];
>   "cgroups2-limits" -> "NetworkManager networking" [color = darkseagreen];
>   "cgroups2-limits" -> "rootless-podman-shared-root-fs" [color = darkseagreen];
>   "cgroups2-limits" -> "seatd elogind" [color = darkseagreen];
>   "cgroups2-limits" -> "udev" [color = darkseagreen];
>   "cgroups2-limits" -> "user-processes" [color = darkseagreen];
37a52
>   "dockerd" -> "seatd elogind" [color = darkgoldenrod];
41a57,59
>   "elogind" -> "dbus-system" [color = darkviolet];
>   "elogind" [label = "elogind", shape = box, fontname = sans];
>   "elogind" -> "user-processes" [color = darkviolet];
62a81,92
>   "file-system-/run/greetd/pam_mount" [label = "file-system-/run/greetd/pam_mount", shape = box, fontname = sans];
>   "file-system-/run/greetd/pam_mount" -> "root-file-system" [color = red];
>   "file-system-/run/greetd/pam_mount" -> "udev" [color = red];
>   "file-system-/run/greetd/runfiles" [label = "file-system-/run/greetd/runfiles", shape = box, fontname = sans];
>   "file-system-/run/greetd/runfiles" -> "root-file-system" [color = peachpuff4];
>   "file-system-/run/greetd/runfiles" -> "udev" [color = peachpuff4];
>   "file-system-/run/systemd" [label = "file-system-/run/systemd", shape = box, fontname = sans];
>   "file-system-/run/systemd" -> "root-file-system" [color = darkseagreen];
>   "file-system-/run/systemd" -> "udev" [color = darkseagreen];
>   "file-system-/run/user" [label = "file-system-/run/user", shape = box, fontname = sans];
>   "file-system-/run/user" -> "root-file-system" [color = magenta];
>   "file-system-/run/user" -> "udev" [color = magenta];
69a100,103
>   "file-systems" -> "file-system-/run/greetd/pam_mount" [color = darkviolet];
>   "file-systems" -> "file-system-/run/greetd/runfiles" [color = darkviolet];
>   "file-systems" -> "file-system-/run/systemd" [color = darkviolet];
>   "file-systems" -> "file-system-/run/user" [color = darkviolet];
70a105
>   "file-systems" -> "file-system-/sys/fs/cgroup/elogind" [color = darkviolet];
73d107
<   "file-systems" -> "file-system-/var/lib/gdm" [color = darkviolet];
78a113,120
>   "file-system-/sys/fs/cgroup/elogind" [label = "file-system-/sys/fs/cgroup/elogind", shape = box, fontname = sans];
>   "file-system-/sys/fs/cgroup/elogind" -> "root-file-system" [color = dimgrey];
>   "file-system-/sys/fs/cgroup/elogind" -> "udev" [color = dimgrey];
>   "file-system-/sys/fs/cgroup" [label = "file-system-/sys/fs/cgroup", shape = box, fontname = sans];
>   "file-system-/sys/fs/cgroup" -> "root-file-system" [color = dimgrey];
>   "file-system-/sys/fs/cgroup" -> "root-file-system" [color = dimgrey];
>   "file-system-/sys/fs/cgroup" -> "udev" [color = dimgrey];
>   "file-system-/sys/fs/cgroup" -> "udev" [color = dimgrey];
85,87d126
<   "file-system-/var/lib/gdm" [label = "file-system-/var/lib/gdm", shape = box, fontname = sans];
<   "file-system-/var/lib/gdm" -> "root-file-system" [color = darkgoldenrod];
<   "file-system-/var/lib/gdm" -> "udev" [color = darkgoldenrod];
116a156
>   "pam" -> "seatd elogind" [color = blue];
123a164,167
>   "rootless-podman-shared-root-fs" [label = "rootless-podman-shared-root-fs", shape = box, fontname = sans];
>   "rootless-podman-shared-root-fs" -> "user-processes" [color = darkviolet];
>   "seatd elogind" [label = "seatd elogind", shape = box, fontname = sans];
>   "seatd elogind" -> "user-processes" [color = cyan3];
135,139d178
<   "term-console" -> "host-name" [color = magenta];
<   "term-console" [label = "term-console", shape = box, fontname = sans];
<   "term-console" -> "system-log syslogd" [color = magenta];
<   "term-console" -> "udev" [color = magenta];
<   "term-console" -> "user-processes" [color = magenta];
141a181
>   "term-tty1" -> "pam" [color = magenta];
146a187
>   "term-tty2" -> "pam" [color = dimgrey];
151a193
>   "term-tty3" -> "pam" [color = darkgoldenrod];
156a199
>   "term-tty4" -> "pam" [color = darkseagreen];
161a205
>   "term-tty5" -> "pam" [color = red];
166a211
>   "term-tty6" -> "pam" [color = peachpuff4];
169a215,227
>   "term-tty7" -> "host-name" [color = blue];
>   "term-tty7" [label = "term-tty7", shape = box, fontname = sans];
>   "term-tty7" -> "pam" [color = blue];
>   "term-tty7" -> "seatd elogind" [color = blue];
>   "term-tty7" -> "udev" [color = blue];
>   "term-tty7" -> "user-processes" [color = blue];
>   "term-tty7" -> "virtual-terminal" [color = blue];
>   "term-tty8" -> "host-name" [color = darkseagreen];
>   "term-tty8" [label = "term-tty8", shape = box, fontname = sans];
>   "term-tty8" -> "pam" [color = darkseagreen];
>   "term-tty8" -> "udev" [color = darkseagreen];
>   "term-tty8" -> "user-processes" [color = darkseagreen];
>   "term-tty8" -> "virtual-terminal" [color = darkseagreen];
208,215c266,267
<   "xorg-server" -> "dbus-system" [color = red];
<   "xorg-server" -> "host-name" [color = red];
<   "xorg-server" [label = "xorg-server", shape = box, fontname = sans];
<   "xorg-server" -> "pam" [color = red];
<   "xorg-server" -> "udev" [color = red];
<   "xorg-server" -> "user-processes" [color = red];
<   "zerotier-one" [label = "zerotier-one", shape = box, fontname = sans];
<   "zerotier-one" -> "NetworkManager networking" [color = red];
---
>   "x11-socket-directory" -> "file-systems" [color = peachpuff4];
>   "x11-socket-directory" [label = "x11-socket-directory", shape = box, fontname = sans];

#+end_example

in-place script

#+begin_example shell :var system="kharis" :dir (expand-file-name ".dotfiles" (getenv "HOME"))
export t=$(mktemp -d) 
export system_x11=kharis-x11
export system_wayland=kharis-x11

# produce the .dot graph files
guix system -L ellipsis/ -L dc/ shepherd-graph \
    "dc/dc/system/$system_x11.scm" > "$t/$system_x11.dot"
guix system -L ellipsis/ -L dc/ shepherd-graph \
    "dc/dc/system/$system_wayland.scm" > "$t/$system_wayland.dot"

# produce the images 
guix system -L ellipsis/ -L dc/ shepherd-graph \
    "dc/dc/system/$system_x11.scm" | dot -Tpng > "$t/$system_x11.png"
guix system -L ellipsis/ -L dc/ shepherd-graph \
    "dc/dc/system/$system_wayland.scm" | dot -Tpng > "$t/$system_wayland.png"

# for basic comparison (at least for simple cases), these can sort because they're flat graphs 
# (i.e. only one edge definition per line, with deterministically computed node id's)
diff <(cat $t/$system_x11.dot | sort) \
    <(cat $t/$system_wayland.dot | sort) > $t/kharis.diff.txt
#+end_example

*** Enumerating =.service= files (WRONG)

#+begin_quote
not for lack of trying...

Though this does discover units not in memory
#+end_quote

It's tough to get =find= to work

#+begin_src shell
find /home/dc/.local/share/{flatpak,systemd} -type f -name "*.service"
#+end_src

Use =systemd-path=

#+begin_src shell :results output verbatim
unitRgx='unit: '
# cut -f1 -d' ' # doesn't split paths correctly
paste \
    <(systemd-path --no-pager | grep -e "$unitRgx" | sed -E 's/^(.*): (.*)$/\1/') \
    <(systemd-path --no-pager | grep -e "$unitRgx" | sed -E 's/^(.*): (.*)$/\2/')
#+end_src

#+RESULTS:
: systemd-system-unit	/nix/store/ymmaa926pv3f3wlgpw9y1aygdvqi1m7j-systemd-257.6/lib/systemd/system
: systemd-user-unit	/nix/store/ymmaa926pv3f3wlgpw9y1aygdvqi1m7j-systemd-257.6/lib/systemd/user
: systemd-search-system-unit	/etc/systemd/system.control:/run/systemd/system.control:/run/systemd/transient:/run/systemd/generator.early:/etc/systemd/system:/nix/var/nix/profiles/default/lib/systemd/system:/etc/systemd/system.attached:/run/systemd/system:/run/systemd/system.attached:/run/systemd/generator:/nix/store/ymmaa926pv3f3wlgpw9y1aygdvqi1m7j-systemd-257.6/lib/systemd/system:/run/systemd/generator.late
: systemd-search-user-unit	/home/dc/.config/systemd/user.control:/run/user/1000/systemd/user.control:/run/user/1000/systemd/transient:/run/user/1000/systemd/generator.early:/home/dc/.config/systemd/user:/etc/xdg/systemd/user:/home/dc/.config/guix/current/etc/xdg/systemd/user:/home/dc/.guix-home/profile/etc/xdg/systemd/user:/home/dc/.guix-profile/etc/xdg/systemd/user:/home/dc/.local/share/flatpak/exports/etc/xdg/systemd/user:/var/lib/flatpak/exports/etc/xdg/systemd/user:/home/dc/.nix-profile/etc/xdg/systemd/user:/home/dc/.local/state/nix/profile/etc/xdg/systemd/user:/etc/profiles/per-user/dc/etc/xdg/systemd/user:/nix/var/nix/profiles/default/etc/xdg/systemd/user:/run/current-system/sw/etc/xdg/systemd/user:/etc/systemd/user:/run/user/1000/systemd/user:/run/systemd/user:/run/user/1000/systemd/generator:/home/dc/.local/share/systemd/user:/gnu/store/mpbhcsairkigzv53dyj6k779dwy2w9d0-shared-mime-info-2.3/share/systemd/user:/gnu/store/rx9fvgchvhjf0bvlad6xsaxkszjw622m-glib-2.83.3/share/systemd/user:/gnu/store/jd59bp9az0fbyrjniar2qd40il5ak4rd-gtk+-3.24.43/share/systemd/user:/gnu/store/m5vcc81k4d27509a708j6swdmqlkkpav-emacs-next-pgtk-31.0.50-1.9663c95/share/systemd/user:/home/dc/.local/share/flatpak/exports/share/systemd/user:/nix/store/vqlrn4r4pvgfwv2yqcc0n985974y3hrb-desktops/share/systemd/user:/home/dc/.config/guix/current/share/systemd/user:/home/dc/.guix-home/profile/share/systemd/user:/home/dc/.guix-profile/share/systemd/user:/var/lib/flatpak/exports/share/systemd/user:/home/dc/.nix-profile/share/systemd/user:/home/dc/.local/state/nix/profile/share/systemd/user:/etc/profiles/per-user/dc/share/systemd/user:/nix/var/nix/profiles/default/share/systemd/user:/run/current-system/sw/share/systemd/user:/nix/store/ymmaa926pv3f3wlgpw9y1aygdvqi1m7j-systemd-257.6/lib/systemd/user:/run/user/1000/systemd/generator.late

Just the paths and pass to find

#+begin_src shell :results output verbatim
unitRgx='unit: '
#pathRgx='dc/.local'
#pathRgx='/'
pathRgx='/etc/systemd/user'

sysPaths=$(systemd-path --no-pager | grep -e "$unitRgx" \
    | sed -E 's/^(.*): (.*)$/\2/' | tr ':' '\n' \
    | sort | uniq | grep -E "$pathRgx")

# cant pass directly to find?
sysPaths=($(echo ${sysPaths[@]} | tr '\n' ' '))

find ${sysPaths[@]} -follow -name '*.service' -type f -printf '%p\n' \
    | while read -n f; do
    # systemctl show --output=json jq '.'
    echo "congratulations youre an idiot"
done
#+end_src

#+RESULTS:
#+begin_example
/etc/systemd/user/graphical-session.target.wants/hypridle.service
/etc/systemd/user/graphical-session.target.wants/yubikey-touch-detector.service
/etc/systemd/user/default.target.wants/nixos-activation.service
/etc/systemd/user/pipewire.service.wants/wireplumber.service
/etc/systemd/user/nixos-activation.service
/etc/systemd/user/dbus.service
#+end_example
